using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Names
{
    internal static class HistogramLogic
    {
        // Метод отримання масиву, що складається з днів місяця (1-31)
        // Примітка: підписи для осі X мають бути рядками
        public static string[] GetXLabels()
        {
            // TODO: напиши свій код тут
            string[] labels = new string[31];
            for (int i = 0; i < 31; i++)
            {
                labels[i] = (i + 1).ToString(); 
            }
            return labels;
        }

        /*
        
        Метод отримання масиву, що складається кількостей народжень для кожного дня місяця для заданого імені

        Він приймає два парамтери:
            - масив names (містить всю статистику по іменам та датам народжень)
            - ім'я name (для якого потрібно підрахувати кількість народжень по днях місяця)
        
        НАГАДУЮ: потрібно ігнорувати 1-е число місяця (тобто підрахунок починається з 2-го числа)!!!
        
        Наприклад, якщо 2-го числа місяця за статистикою народилось 5 людей з ім'ям "Олександр",
        3-го числа - 10 людей з ім'ям "Олександр", 4-го числа - 7 людей з ім'ям "Олександр" і так далі,
        то масив, що поверне метод, матиме вигляд: [0, 5, 10, 7, ...].

        Орієнтовний алгоритм звучить так: метод проходить по масиву names (тобто, по всім даним), 
        та коли натрапляє на ім'я name (конкретне ім'я, для якого треба вивести статистику на екран), 
        то дивиться на день народження цієї людини і збільшує відповідний елемент масиву 
        (що відповідає за конкретний день ісяця) на 1. 
        
        Приклад зберігання даних у базі:

        27.06.1964	лилія
        02.01.1974	олексій
        09.11.1969	рамис
        12.05.1974	катерина
        10.12.1975	дмитро
        31.03.1967	володимир
        27.07.1971	олександр
        01.06.1965	володимир
        25.02.1963	олександр
        20.02.1961	володимир
        ...
        24.06.1983	ілля
        24.01.1951	ганна
        09.03.1952	віктор
        23.02.1978	олексій
        27.02.1978	ірина

        Тобто, саме у такій "хаотичній" послідовності вони розташовані в масиві names.

        Пара важливих технічних моментів:

            - Звернення до ім'я людини в масиві names відбувається в форматі X.Name, де X - це елемент масиву names.
            - Звернення до дня народження людини в масиві names відбувається в форматі X.BirthDate.Day, де X - це елемент масиву names.

        УСПІХІВ)

         */

        public static double[] GetBirthCounts(NameData[] names, string name)
        {
            // TODO: напиши свій код тут
            
            var counts = new double[31];
            

            foreach (var person in names)
            {
                if (person.Name == name)
                {
                    
                    if (person.BirthDate.Day >= 2) counts[person.BirthDate.Day - 1]++;
                }
            }

            return counts;
        }
    }
}
